SprayModel_OpenFOAM/0/U.air
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (2 0 0);

boundaryField
{
    ground
    {
        type            noSlip;
    }

    sides
    {

        type            fixedValue;
        value           uniform (2 0 0);
    }

    front
    {
        type            fixedValue;
        value           uniform (2 0 0);

    }

    back
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (2 0 0);
        phi             phi.air;
        U               U.air;
    }

    top
    {
        type            fixedValue;
        value           uniform (2 0 0);         // rho*u**2
    }
}


// ************************************************************************* //
